# Faster R-CNN with Resnet-50 (v1), configuration for MSCOCO Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "PATH_TO_BE_CONFIGURED" to find the fields that
# should be configured.

model {
  faster_rcnn {
    num_classes: 11
    image_resizer {
      identity_resizer {
      }
    }
    feature_extractor {
      type: 'faster_rcnn_resnet50'
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 300
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}

train_config: {
  batch_size: 8
  batch_queue_capacity: 2
  num_batch_queue_threads: 2
  prefetch_queue_capacity: 2
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        cosine_decay_learning_rate {
          learning_rate_base: 0.005
          warmup_learning_rate: 0.0005
          warmup_steps: 400
          total_steps: 40000
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "./models/tf-faster-resnet50-finetune/model.ckpt"
  from_detection_checkpoint: true
  # Note: The below line limits the training process to 200K steps, which we
  # empirically found to be sufficient enough to train the pets dataset. This
  # effectively bypasses the learning rate schedule (the learning rate will
  # never decay). Remove the below line to train indefinitely.
  num_steps: 40000
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "./data/tf_obj_det/train/train.record-?????-of-00100"
  }
  label_map_path: "./data/tf_obj_det/label_map.pbtxt"
  shuffle_buffer_size: 12
  filenames_shuffle_buffer_size: 12
  queue_capacity: 12
  min_after_dequeue: 4
  num_readers: 1
  num_parallel_batches: 1
  num_prefetch_batches: 2
  prefetch_size: 4
}

eval_config: {
  num_examples: 785
  batch_size: 1
  num_visualizations: 1  
  save_graph: false
  
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "./data/tf_obj_det/validation/validation.record"
  }
  label_map_path: "./data/tf_obj_det/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  shuffle_buffer_size: 1
  filenames_shuffle_buffer_size: 1
  queue_capacity: 1
  min_after_dequeue: 1
  num_parallel_batches: 1
  num_prefetch_batches: 1
  prefetch_size: 1
}